src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_МП_Токены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_МП_Токены</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_WB_Профили</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Добавлен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвойстваТокенаВБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркетплейс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продвижение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопросы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возвраты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тарифы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоЧтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТестовыйКонтур</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИС_ВБ_СерверПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
Функция НастройкиСоединения(Профиль) Экспорт
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ;
	МассивПараметров = ИС_ВБ_Сервер.МассивНастроекПодключения();
	
	Результат = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
			
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
Функция ТокенДляСервиса(Профиль, Сервис) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_МП_Токены.Токен КАК Токен
	|ИЗ
	|	Справочник.ИС_МП_Токены.СвойстваТокенаВБ КАК ИС_МП_ТокеныСвойстваТокенаВБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_МП_Токены КАК ИС_МП_Токены
	|		ПО ИС_МП_ТокеныСвойстваТокенаВБ.Ссылка = ИС_МП_Токены.Ссылка
	|ГДЕ
	|	ИС_МП_Токены.Владелец = &Профиль
	|	И ИС_МП_Токены.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.ИС_МП_Маркетплейсы.ВБ)
	|	И НЕ ИС_МП_Токены.ПометкаУдаления
	|	И &Сервис
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИС_МП_ТокеныСвойстваТокенаВБ.ДатаОкончания УБЫВ";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Сервис", "ИС_МП_ТокеныСвойстваТокенаВБ." + Сервис);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаТокена = РезультатЗапроса.Выбрать();
	
	ВыборкаТокена.Следующий();

	Возврат ВыборкаТокена.Токен;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

#КонецОбласти
